#+CATEGORY: NovelDownloader

* TODO v1.0
** DONE v0.1
   CLOSED: [2020-03-21 週六 15:04] SCHEDULED: <2020-03-14 週六>
*** DONE before release
    CLOSED: [2020-03-21 週六 15:03] SCHEDULED: <2020-03-21 週六>
**** DONE add git tag
     CLOSED: [2020-03-21 週六 15:03] SCHEDULED: <2020-03-21 週六>
     :LOGBOOK:
     CLOCK: [2020-03-21 週六 15:03]--[2020-03-21 週六 15:03] =>  0:00
     :END:
**** DONE add version option for the program
     CLOSED: [2020-03-21 週六 15:02] SCHEDULED: <2020-03-21 週六>
     :LOGBOOK:
     CLOCK: [2020-03-21 週六 14:41]--[2020-03-21 週六 15:02] =>  0:21
     :END:
*** DONE add processor factory module
    CLOSED: [2020-03-07 週六 16:57] SCHEDULED: <2020-03-07 週六>
    :LOGBOOK:
    CLOCK: [2020-03-07 週六 16:27]--[2020-03-07 週六 16:56] =>  0:29
    :END:
*** DONE read processor configuration from a file
    CLOSED: [2020-03-07 週六 17:29] SCHEDULED: <2020-03-07 週六>
    :LOGBOOK:
    CLOCK: [2020-03-07 週六 17:16]--[2020-03-07 週六 17:29] =>  0:13
    CLOCK: [2020-03-07 週六 17:02]--[2020-03-07 週六 17:12] =>  0:10
    :END:
*** DONE add readme file
    CLOSED: [2020-03-14 週六 15:26] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 15:02]--[2020-03-14 週六 15:26] =>  0:24
    :END:
*** DONE update documentation of novelDownloader.pl
    CLOSED: [2020-03-14 週六 14:59] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 14:37]--[2020-03-14 週六 14:59] =>  0:22
    :END:
*** DONE push repository to github
    CLOSED: [2020-03-14 週六 15:31] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 15:27]--[2020-03-14 週六 15:31] =>  0:04
    :END:
** TODO v0.2
*** TODO before release
**** TODO add git tag
**** TODO update version string
*** TODO add unit tests [0%]
    - [ ] XHTML::Writer.pm
    - [ ] NovelDownloader::Downloader.pm
    - [ ] NovelDownloader::Exporter.pm
    - [ ] NovelDownloader::Wenku8Downloader.pm
    - [ ] NovelDownloader::Wenku8Exporter.pm
    - [ ] NovelDownloader::ProcessorFactory.pm
*** TODO add documentations [0%]
    - [ ] novelDownloader.pl
    - [ ] XHTML::Writer.pm
    - [ ] NovelDownloader::Downloader.pm
    - [ ] NovelDownloader::Exporter.pm
    - [ ] NovelDownloader::Wenku8Downloader.pm
    - [ ] NovelDownloader::Wenku8Exporter.pm
    - [ ] NovelDownloader::ProcessorFactory.pm
*** TODO support configuration
*** TODO support user level processor configuration file
*** TODO seperate data structure to different module
*** TODO automatic include module directory into program
** TODO before release
*** TODO add git tag
*** TODO update version string
* TODO v1.1
** DONE support comicbus.com
   CLOSED: [2020-04-19 週日 17:28] SCHEDULED: <2020-03-21 週六>
   :LOGBOOK:
   CLOCK: [2020-04-19 週日 16:45]--[2020-04-19 週日 17:24] =>  0:39
   CLOCK: [2020-04-18 週六 20:00]--[2020-04-18 週六 20:40] =>  0:40
   CLOCK: [2020-04-18 週六 17:15]--[2020-04-18 週六 18:05] =>  0:50
   CLOCK: [2020-04-18 週六 16:44]--[2020-04-18 週六 17:11] =>  0:27
   CLOCK: [2020-04-12 週日 13:20]--[2020-04-12 週日 13:28] =>  0:08
   CLOCK: [2020-04-12 週日 11:31]--[2020-04-12 週日 12:20] =>  0:49
   CLOCK: [2020-04-12 週日 11:01]--[2020-04-12 週日 11:29] =>  0:28
   CLOCK: [2020-04-11 週六 17:35]--[2020-04-11 週六 18:30] =>  0:55
   CLOCK: [2020-04-11 週六 14:53]--[2020-04-11 週六 17:28] =>  2:35
   CLOCK: [2020-04-11 週六 13:01]--[2020-04-11 週六 13:21] =>  0:20
   CLOCK: [2020-04-04 週六 17:13]--[2020-04-04 週六 17:20] =>  0:07
   CLOCK: [2020-04-04 週六 16:30]--[2020-04-04 週六 16:55] =>  0:25
   CLOCK: [2020-04-04 週六 15:55]--[2020-04-04 週六 16:27] =>  0:32
   CLOCK: [2020-04-04 週六 15:06]--[2020-04-04 週六 15:52] =>  0:46
   CLOCK: [2020-04-04 週六 14:41]--[2020-04-04 週六 15:04] =>  0:23
   CLOCK: [2020-03-29 週日 12:48]--[2020-03-29 週日 12:57] =>  0:09
   CLOCK: [2020-03-29 週日 11:36]--[2020-03-29 週日 11:54] =>  0:18
   CLOCK: [2020-03-29 週日 10:26]--[2020-03-29 週日 11:33] =>  1:07
   CLOCK: [2020-03-28 週六 19:26]--[2020-03-28 週六 20:14] =>  0:48
   CLOCK: [2020-03-28 週六 17:12]--[2020-03-28 週六 18:27] =>  1:15
   CLOCK: [2020-03-28 週六 15:44]--[2020-03-28 週六 16:27] =>  0:43
   CLOCK: [2020-03-28 週六 15:28]--[2020-03-28 週六 15:43] =>  0:15
   CLOCK: [2020-03-21 週六 17:47]--[2020-03-21 週六 18:19] =>  0:32
   CLOCK: [2020-03-21 週六 17:23]--[2020-03-21 週六 17:46] =>  0:23
   CLOCK: [2020-03-21 週六 16:55]--[2020-03-21 週六 17:16] =>  0:21
   CLOCK: [2020-03-21 週六 15:16]--[2020-03-21 週六 16:51] =>  1:35
   :END:
** TODO support seba.com
** TODO before release
*** TODO add git tag
*** TODO update version string
* TODO v1.2
** TODO add GUI
** TODO before release
*** TODO add git tag
*** TODO update version string
* unplanned
** TODO build self contained binary
** TODO support cover image for www.wenku8.com
** TODO support default download
   - download according to a configuration file
   - download only when need to update
** TODO support parallel download
** TODO add traditional chinese readme file
** TODO support interface for different programming language
*** TODO support by ipc
*** TODO support by Inline module
